Revit 2026 API

# StripedRowPattern Enumeration

---

An enumerated type representing the possible sets of rows of a striped row schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StripedRowPattern
```
```vb
Public Enumeration StripedRowPattern
```
```cpp
public enum class StripedRowPattern
```
```fsharp
type StripedRowPattern
```

| Member name | Value | Description |
| --- | --- | --- |
| FirstRow | 0 | The first row and every other row thereafter. |
| SecondRow | 1 | The second row and every other row thereafter. |

#### Reference

Autodesk.Revit.DB Namespace